products = {
    "DUa584": {
        "name": "PVC модулна подова настилка за гараж – сива квадратна плочка",
        "color": "сива",
        "size": (0.4, 0.4),  # Размери в метри
        "price": 5.79  # Цена на плочка в лева
    },
    "DUa583": {
        "name": "PVC модулна подова настилка за гараж – черна квадратна плочка",
        "color": "черна",
        "size": (0.4, 0.4),
        "price": 5.79
    },
    "DUa599": {
        "name": "PVC модулна подова гаражна настилка – лилава",
        "color": "лилава",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa592": {
        "name": "PVC модулна подова настилка за гараж и работилница – оранжева",
        "color": "оранжева",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa590": {
        "name": "PVC модулна подова настилка за гараж и сервиз – светло сива",
        "color": "светло сива",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa598": {
        "name": "PVC модулна подова настилка за гараж и сервиз – синя",
        "color": "синя",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa597": {
        "name": "PVC модулна подова настилка за гараж и студиа – светло синя",
        "color": "светло синя",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa596": {
        "name": "PVC модулна подова настилка за гараж работилница – синя тюркоаз",
        "color": "синя тюркоаз",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa595": {
        "name": "PVC модулна подова настилка за гараж шоурум – тъмно зелена",
        "color": "тъмно зелена",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa591": {
        "name": "PVC модулна подова настилка за гараж – бяла квадратна плочка",
        "color": "бяла",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa585": {
        "name": "PVC модулна подова настилка за гараж – жълта квадратна плочка",
        "color": "жълта",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa600": {
        "name": "PVC модулна подова настилка за гараж – розова",
        "color": "розова",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa593": {
        "name": "PVC модулна подова настилка за гараж – светло зелена",
        "color": "светло зелена",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa586": {
        "name": "PVC модулна подова настилка за гараж – червена квадратна плочка",
        "color": "червена",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa594": {
        "name": "PVC модулна подова настилка за гараж – ярко зелена",
        "color": "ярко зелена",
        "size": (0.4, 0.4),
        "price": 5.99
    },
    "DUa644": {
        "name": "PVC плочка за модулен под за гаражи – жълт 3D дизайн",
        "color": "жълта",
        "size": (0.4, 0.4),
        "price": 7.59
    },
    "DUa643": {
        "name": "PVC плочка за модулен под за гаражи – зелен 3D дизайн",
        "color": "зелена",
        "size": (0.4, 0.4),
        "price": 7.59
    },
    "DUa640": {
        "name": "PVC плочка за модулен под за гаражи – сив 3D дизайн",
        "color": "сива",
        "size": (0.4, 0.4),
        "price": 7.59
    },
    "DUa641": {
        "name": "PVC плочка за модулен под за гаражи – син 3D дизайн",
        "color": "синя",
        "size": (0.4, 0.4),
        "price": 7.59
    },
    "DUa642": {
        "name": "PVC плочка за модулен под за гаражи – червен 3D дизайн",
        "color": "червена",
        "size": (0.4, 0.4),
        "price": 7.59
    },
    "DUa639": {
        "name": "PVC плочка за модулен под за гаражи – черен 3D дизайн",
        "color": "черна",
        "size": (0.4, 0.4),
        "price": 7.59
    },
    "DUa653": {
        "name": "PVC подова настилка – противоплъзгаща и устойчива, сив цвят",
        "color": "сива",
        "size": (0.5, 0.5),
        "price": 26.99
    },
    "DUa649": {
        "name": "Плочки за декинг на тераса, двор и градина – модулен под Антрацит",
        "color": "антрацит",
        "size": (0.3, 0.3),
        "price": 5.99
    },
    "DUa650": {
        "name": "Плочки за декинг на тераса, двор и градина – модулен под в кафяво",
        "color": "кафяво",
        "size": (0.3, 0.3),
        "price": 5.99
    },
    "DUa652": {
        "name": "Плочки за декинг на тераса, двор и градина – модулен под с визия на дърво",
        "color": "дърво",
        "size": (0.3, 0.3),
        "price": 5.99
    },
    "DUa651": {
        "name": "Плочки за декинг с изкуствена трева за тераса, двор и градина – модулен под Зелен",
        "color": "зелен",
        "size": (0.3, 0.3),
        "price": 7.69
    }
}
